In [2]:
import pandas as pd

In [3]:
df_imdb_basics = pd.read_csv('Data/imdb.name.basics.csv')
print(df_imdb_basics.shape)
df_imdb_basics.head()

(606648, 6)

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [4]:
df_imdb_basics

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [5]:
df_imdb_basics.isnull().any()

nconst                False
primary_name          False
birth_year             True
death_year             True
primary_profession     True
known_for_titles       True
dtype: bool

In [6]:
df_imdb_basics.isnull().sum()

nconst                     0
primary_name               0
birth_year            523912
death_year            599865
primary_profession     51340
known_for_titles       30204
dtype: int64

In [7]:
len(df_imdb_basics)

606648

In [9]:
(30204/606648)*100

4.97883451358943

In [11]:
df_name = df_imdb_basics.loc[df_imdb_basics['known_for_titles'].isnull() == False]

In [12]:
df_name.isnull().sum()

nconst                     0
primary_name               0
birth_year            493895
death_year            569766
primary_profession     41307
known_for_titles           0
dtype: int64

In [20]:
df_name.tail()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
606640,nm9989854,Layla Louise,1990.0,NaN,"actress,stunts","tt9910102,tt9898328,tt9335490,tt8894778"
606642,nm9990296,Fleurette Dicaire,NaN,NaN,NaN,tt8319420
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [14]:
df_name['known_for_titles'][0]

'tt0837562,tt2398241,tt0844471,tt0118553'

In [25]:
df_title = df_name['known_for_titles'][0].split(',')

In [26]:
type(df_title)

list

In [28]:
df_title

['tt0837562', 'tt2398241', 'tt0844471', 'tt0118553']

In [30]:
for i in df_title:
    print (i)

tt0837562
tt2398241
tt0844471
tt0118553

In [31]:
df_movie_title = pd.read_csv('Data/imdb.title.basics.csv')
print(df_movie_title.shape)
df_movie_title.head()

(146144, 6)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [33]:
for i in df_title:
    print(df_movie_title.loc[df_movie_title['tconst'] == i])

        tconst       primary_title      original_title  start_year  \
336  tt0837562  Hotel Transylvania  Hotel Transylvania        2012

     runtime_minutes                   genres
336             91.0  Animation,Comedy,Family
          tconst             primary_title            original_title  \
39116  tt2398241  Smurfs: The Lost Village  Smurfs: The Lost Village

       start_year  runtime_minutes                      genres
39116        2017             90.0  Adventure,Animation,Comedy
Empty DataFrame
Columns: [tconst, primary_title, original_title, start_year, runtime_minutes, genres]
Index: []
Empty DataFrame
Columns: [tconst, primary_title, original_title, start_year, runtime_minutes, genres]
Index: []

In [34]:
df_movie_title.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [35]:
df_name.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [36]:
df_name['known_for_titles'][0].split(',')

['tt0837562', 'tt2398241', 'tt0844471', 'tt0118553']

In [37]:
len(df_name['known_for_titles'][0].split(','))

4

In [39]:
df_name.index

Int64Index([     0,      1,      2,      3,      4,      5,      6,      7,
                 8,      9,
            ...
            606633, 606634, 606635, 606636, 606639, 606640, 606642, 606644,
            606645, 606647],
           dtype='int64', length=576444)

In [40]:
df_name['num_titles'] = [ len(df_name['known_for_titles'][x].split(',')) for x in df_name.index ]
df_name.head()

C:\Users\poari\Anaconda3\envs\learn-env\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles,num_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553",4
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940",4
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898",4
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387",4
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256",4

In [41]:
df_name.tail()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles,num_titles
606640,nm9989854,Layla Louise,1990.0,NaN,"actress,stunts","tt9910102,tt9898328,tt9335490,tt8894778",4
606642,nm9990296,Fleurette Dicaire,NaN,NaN,NaN,tt8319420,1
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130",2
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610",2
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182,1

In [42]:
df_name['num_titles'].max()

6

In [43]:
df_name['num_titles'].loc[(df_name['primary_name'] == 'Scarlett Johansson')]

17261    4
Name: num_titles, dtype: int64

In [44]:
df_name.loc[(df_name['primary_name'] == 'Scarlett Johansson')]

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles,num_titles
17261,nm0424060,Scarlett Johansson,1984.0,NaN,"actress,soundtrack,producer","tt1798709,tt1441395,tt0335266,tt0848228",4

In [ ]:
for name in list:
    n = df_name.loc[(df_name['primary_name'] == name)]
    for i in range(n):